### 
https://colab.research.google.com/drive/1H7uYyuVq5XfrytEhd96rWspz9Vj2TBal?usp=sharing

In [1]:
import pandas as pd

In [2]:
TT= pd.read_csv('titanic.csv')

In [6]:
TT.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [9]:
# EXISTEM APENSAS DOIS TIPOS DE VALORES UNICOS NESRA COLUNA:
gen = TT['Sex'].unique()
display(gen)

array(['male', 'female'], dtype=object)

In [14]:
split_sex = TT.groupby('Sex')

In [33]:
x = list(split_sex)
#display(x) 

# for I in x:
#     print(I)

In [23]:
split_Sobreviventes = TT.groupby('Survived')

In [24]:
# OS VALORES NESTA COLUNA SÃO BINÁRIOS:
TT["Survived"].unique()

array([0, 1])

In [27]:
# ZERO ABRANGE O GRUPO DE PESSOAS QUE NÃO SOBREVIVERAM
# E 'UM' (na sétima linha) REPRESENTA ou ABRANGE O NUMERO/IDENTIFICAÇÃO
#..DE CADA SOBREVIVENTE.
split_Sobreviventes.groups

{0: [0, 4, 5, 6, 7, 12, 13, 14, 16, 18, 20, 24, 26, 27, 29, 30, 33, 34, 35, 37, 38, 40, 41, 42, 45, 46, 48, 49, 50, 51, 54, 57, 59, 60, 62, 63, 64, 67, 69, 70, 71, 72, 73, 75, 76, 77, 80, 83, 86, 87, 89, 90, 91, 92, 93, 94, 95, 96, 99, 100, 101, 102, 103, 104, 105, 108, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 124, 126, 129, 130, 131, 132, 134, 135, 137, 138, 139, 140, 143, 144, 145, 147, 148, 149, 150, 152, 153, ...], 1: [1, 2, 3, 8, 9, 10, 11, 15, 17, 19, 21, 22, 23, 25, 28, 31, 32, 36, 39, 43, 44, 47, 52, 53, 55, 56, 58, 61, 65, 66, 68, 74, 78, 79, 81, 82, 84, 85, 88, 97, 98, 106, 107, 109, 123, 125, 127, 128, 133, 136, 141, 142, 146, 151, 156, 161, 165, 166, 172, 183, 184, 186, 187, 190, 192, 193, 194, 195, 198, 204, 207, 208, 209, 211, 215, 216, 218, 220, 224, 226, 230, 233, 237, 241, 247, 248, 255, 256, 257, 258, 259, 261, 267, 268, 269, 271, 272, 274, 275, 279, ...]}

In [29]:
split_Sobreviventes = TT.groupby(by=["Sex", "Survived"])

In [31]:
# SOBREVIVENTES 1 E NÃO SOBREVIVENTES 0 DE CADA SEXO:
split_Sobreviventes.count()

                 PassengerId  Pclass  Name  Age  SibSp  Parch  Ticket  Fare  \
Sex    Survived
female 0                  81      81    81   64     81     81      81    81
       1                 233     233   233  197    233    233     233   233
male   0                 468     468   468  360    468    468     468   468
       1                 109     109   109   93    109    109     109   109

                 Cabin  Embarked
Sex    Survived
female 0             6        81
       1            91       231
male   0            62       468
       1            45       109